The aim of this project is to build a model that will predict the income of an individual.

**Note that the data set is an income of individuals with different features explaining the target variable.**


Carry out the machine learning stages/task using the dataset accompany with this mail  and answer the following questions:


* What type of Machine learning problem is this?. Please load the dataset  and identify the target variable before coming into a conclusion.

1. Checking for missing values in the dataset ( in this particular dataset, there are inconsistency values like “?”) , explain how you intend dealing with these values?

2. Check for the shape of the dataframe?

3. Explore the important columns and give insight based on the columns

4. Check for skewness and outliers in the dataset

5. Use a transformer to transform the columns above

It would be great to see you define a class object with all these methods sighted below ( That will be so great to see , you know ?)

In [1]:
import pandas as pd
import numpy as np 
import seaborn as sns
from matplotlib import pyplot as plt

from sklearn import tree
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split, GridSearchCV
from sklearn.metrics import accuracy_score, f1_score, confusion_matrix, roc_auc_score, roc_curve
#from pandas_profiling import ProfileReport
import sklearn.metrics as metrics

from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn import preprocessing

from sklearn.pipeline import Pipeline, make_pipeline

In [7]:
df1 = pd.read_csv('C:/Users/STUTERN/Downloads/adult.data', names = ['age', 'workclass', 'fnlwgt', 'education', 
                                                                   'eductaion_num', 'marital_status', 'occupation', 
                                                                   'relationship', 'race', 'sex', 'capital_gain', 
                                                                   'capital_loss', 'house_per_week', 'native_country', 
                                                                   'income'])

In [8]:
df1.shape

(32561, 15)

In [10]:
df.isin(['?']).sum(axis=0)

age               0
workclass         0
fnlwgt            0
education         0
eductaion_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
house_per_week    0
native_country    0
income            0
dtype: int64

In [9]:
df = pd.read_csv(r'C:\Users\STUTERN\Downloads\adult.data', names = ['age', 'workclass', 'fnlwgt', 'education', 
                                                                   'eductaion_num', 'marital_status', 'occupation', 
                                                                   'relationship', 'race', 'sex', 'capital_gain', 
                                                                   'capital_loss', 'house_per_week', 'native_country', 
                                                                   'income'])
df.head()

,age,workclass,fnlwgt,education,eductaion_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,house_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [75]:
df.shape

(32561, 15)

In [115]:
df['income'].value_counts()

 <=50K    24720
 >50K      7841
Name: income, dtype: int64

In [116]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'eductaion_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'house_per_week', 'native_country',
       'income'],
      dtype='object')

Since the dataset is about income of individuals and it still has an income column, So I choose the target variable to be the income column. And I checked and found out that it has just 2 values (<=50k and >50k), making it a categorical column. So this is problem is going to be a Supervised Classification ML Model

In [117]:
raw_df = df.copy()

### Data Cleaning

In [118]:
# checking for missing values
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
eductaion_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
house_per_week    0
native_country    0
income            0
dtype: int64

In [119]:
df.isin(['?']).sum(axis=0)

age               0
workclass         0
fnlwgt            0
education         0
eductaion_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
house_per_week    0
native_country    0
income            0
dtype: int64

In [120]:
(df == '?').any()

age               False
workclass         False
fnlwgt            False
education         False
eductaion_num     False
marital_status    False
occupation        False
relationship      False
race              False
sex               False
capital_gain      False
capital_loss      False
house_per_week    False
native_country    False
income            False
dtype: bool

In [121]:
# checking if there are duplicate rows
df.duplicated().sum()

24

In [122]:
# dropping the duplicate rows
df = df.drop_duplicates()

In [123]:
# comfirming if the duplicates are dropped
df.duplicated().sum()

0

In [124]:
#creating a function to check the value counts of the columns

for i in df.columns:
    i = df.value_counts(i)
    print(f'\n\n\nvalues of {i}')

values of age
36    898
31    888
34    886
23    876
33    875
     ...
83      6
85      3
88      3
86      1
87      1
Length: 73, dtype: int64



values of workclass
 Private             22673
 Self-emp-not-inc     2540
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
dtype: int64



values of fnlwgt
203488     13
164190     13
123011     13
126675     12
148995     12
           ..
158752      1
158762      1
158776      1
158784      1
1484705     1
Length: 21648, dtype: int64



values of education
 HS-grad         10494
 Some-college     7282
 Bachelors        5353
 Masters          1722
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           645
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           332
 1st-4th           166
 Preschool          50
dtype: int64



values of eductaion_num
9     10494
10     7282
13     5353
14     1722
11     1382
7      1175
12     1067
6       933
4       645
15      576
5       514
8       433
16      413
3       332
2       166
1        50
dtype: int64



values of marital_status
 Married-civ-spouse       14970
 Never-married            10667
 Divorced                  4441
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
dtype: int64



values of occupation
 Prof-specialty       4136
 Craft-repair         4094
 Exec-managerial      4065
 Adm-clerical         3768
 Sales                3650
 Other-service        3291
 Machine-op-inspct    2000
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1369
 Farming-fishing       992
 Tech-support          927
 Protective-serv       649
 Priv-house-serv       147
 Armed-Forces            9
dtype: int64



values of relationship
 Husband           13187
 Not-in-family      8292
 Own-child          5064
 Unmarried          3445
 Wife               1568
 Other-relative      981
dtype: int64



values of race
 White                 27795
 Black                  3122
 Asian-Pac-Islander     1038
 Amer-Indian-Eskimo      311
 Other                   271
dtype: int64



values of sex
 Male      21775
 Female    10762
dtype: int64



values of capital_gain
0        29825
15024      347
7688       284
7298       246
99999      159
         ...
1455         1
4931         1
2538         1
1639         1
6097         1
Length: 119, dtype: int64



values of capital_loss
0       31018
1902      202
1977      168
1887      159
1848       51
        ...
2282        1
1844        1
155         1
2080        1
1944        1
Length: 92, dtype: int64



values of house_per_week
40    15204
50     2817
45     1823
60     1475
35     1296
      ...
92        1
94        1
87        1
82        1
74        1
Length: 94, dtype: int64



values of native_country
 United-States                 29153
 Mexico                          639
 ?                               582
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        62
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
dtype: int64



values of income
 <=50K    24698
 >50K      7839
dtype: int64

This shows that the Workclass, occupation, and native_country has inconsistencies('?') which needs to be treated before exploration.

In [125]:
#(df['workclass'] == '?' ).any()

In [126]:
#df.columns.isin(['?']).any()

In [127]:
#df['workclass'].isin(['?']).any()

In [128]:
df.replace('?',np.nan,inplace=True)
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
eductaion_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
house_per_week    0
native_country    0
income            0
dtype: int64

In [129]:
df = df.replace('?', np.NAN)
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
eductaion_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
house_per_week    0
native_country    0
income            0
dtype: int64

In [130]:
# Transforming the 'Income' Column 
# encode = preprocessing.LabelEncoder()
# df['income'] = encode.fit_transform(df['income'])

In [138]:
bins = ['<=50K', '>50K']
labels=['0','1']
pd.cut(df['income'], bins=bins, labels=labels)

ValueError: could not convert string to float: '<=50K'

In [139]:
df["income"] = df["income"].map({"<=50K" : 0 , ">50K" : 1})
df.head()

,age,workclass,fnlwgt,education,eductaion_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,house_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,NaN
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,NaN
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,NaN
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,NaN
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,NaN

### EDA

In [133]:
df.select_dtypes("number").columns

Index(['age', 'fnlwgt', 'eductaion_num', 'capital_gain', 'capital_loss',
       'house_per_week', 'income'],
      dtype='object')

In [134]:
df.corr()

,age,fnlwgt,eductaion_num,capital_gain,capital_loss,house_per_week,income
age,1.000000,-0.076447,0.036224,0.077676,0.057745,0.068515,NaN
fnlwgt,-0.076447,1.000000,-0.043388,0.000429,-0.010260,-0.018898,NaN
eductaion_num,0.036224,-0.043388,1.000000,0.122664,0.079892,0.148422,NaN
capital_gain,0.077676,0.000429,0.122664,1.000000,-0.031639,0.078408,NaN
capital_loss,0.057745,-0.010260,0.079892,-0.031639,1.000000,0.054229,NaN
house_per_week,0.068515,-0.018898,0.148422,0.078408,0.054229,1.000000,NaN
income,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [1]:
df.corr()["income"].sort_values(ascending = True).index[:10]

NameError: name 'df' is not defined